Repository: J0nathan550/Free-Spotify
Catalog: Free Spotify/Localization/Localization.*.resx
Languages: ja, uk

# AddButtonText
source: Add
ja: 加える。
uk: Додати

# AddPlaylistText
source: Add playlist
ja: プレイリストの追加
uk: Додати плейлист

# AddSongToPlaylistText
source: Add song to playlist
ja: プレイリストに曲を追加する
uk: Додати пісню в плейлист

# AddTrackErrorText
source: To add a track to a playlist, click the button next to the playlist.
ja: プレイリストにトラックを追加するには、プレイリストの横にあるボタンをクリックします。
uk: Щоб додати трек у плейлист, натисніть на кнопку поруч із плейлистом.

# AmountTracksDefaultText
source: Number of tracks:
ja: トラック数：
uk: Кількість треків:

# AppCurrentVersionDefaultText
source: Current Version:
ja: 現在のバージョン：
uk: Поточна версія:

# ArtistDefaultText
source: Artist:
ja: アーティスト：
uk: Артист:

# BallonPlayerCheckBoxToolTip
source: When the window is minimized, a player will pop up when you switch songs, which you can customize however you like.
ja: ウィンドウを最小化すると、曲の切り替え時にプレーヤーがポップアップ表示され、好きなように設定できる。
uk: Коли вікно згорнуто, під час перемикання пісні спливатиме плеєр, який можна налаштувати як завгодно.

# BallonPlayerText
source: Pop-up window of MP3Player:
ja: 選手が飛び出す：
uk: Спливаюче вікно програвача:

# CancelButtonText
source: Cancel
ja: 廃止
uk: Скасувати

# CheckUpdatesMenuItemHeader
source: Check for updates
ja: アップデートの確認
uk: Перевірити оновлення

# CreatePlaylistText
source: Create a playlist
ja: プレイリストの作成
uk: Створити плейлист

# DeleteDefaultText
source: Delete
ja: 削除
uk: Видалити

# DiscordRPCAFK
source: Doesn't do anything...
ja: 何の役にも立たない...
uk: Нічого не робить...

# DiscordRPCListeningTo
source: Listening to music...
ja: 彼は音楽を聴く...
uk: Слухає музику...

# DiscordRPCListenToTrack
source: Listen to the track...
ja: トラックを聴く...
uk: Послухати трек...

# DiscordRPCPausedTrack
source: Paused the music...
ja: 私は音楽を一時停止した...
uk: Поставив музику на паузу...

# EnterPlaylistTitleDefaultText
source: Enter the name of the playlist...
ja: プレイリストの名前を入力...
uk: Введіть назву плейлиста...

# ErrorEnterTheTitleDefaultText
source: Type in the name of the playlist first!
ja: 最初にプレイリストの名前を入力します！
uk: Спершу введіть назву плейлиста!

# ErrorJSONCorrupted
source: The settings file has been corrupted, the settings have been reset to default.
ja: 設定ファイルが破損し、設定がデフォルトにリセットされました。
uk: Файл із налаштуваннями було пошкоджено, налаштування скинуто за замовчуванням.

# ErrorNoInternetText
source: Looks like you're having internet problems!
ja: インターネットに問題があるようですね！
uk: Схоже у вас проблеми з інтернетом!

# ErrorNoPlaylist
source: Create a playlist to add tracks!
ja: プレイリストを作成してトラックを追加する！
uk: Створіть плейлист щоб додавати треки!

# ErrorNothingFoundText
source: By request:
ja: リクエストに応じて：
uk: По запиту:

# ErrorNothingFoundText1
source: nothing was found.
ja: 何も見つかっていない。
uk: нічого не знайдено.

# ErrorText
source: Error!
ja: 間違いだ！
uk: Помилка!

# FilterForDialogDefaultText
source: JPEG Files (*.jpg;*.jpeg)|*.jpg;*.jpeg|PNG Files (*.png)|*.png|GIF Files (*.gif)|*.gif|All Files (*.*)|*.*
ja: JPEGファイル(*.jpg;*.jpeg)|*.jpg;*.jpeg|PNGファイル(*.png)|*.png|GIFファイル(*.gif)|*.gif|すべてのファイル(*.*)|*.*
uk: JPEG Файли (*.jpg;*.jpeg)|*.jpg;*.jpeg|PNG Файли (*.png)|*.png|GIF Файли (*.gif)|*.gif|Всі файли (*.*)|*.*

# HoursText
source: h
ja: 時
uk: ч

# ImagePlaylistDefaultText
source: Picture (optional):
ja: 写真（オプション）：
uk: Картинка (опційно):

# LanguageSettingsDefaultText
source: Language:
ja: 言語：
uk: Мова:

# MinutesText
source: min
ja: 分
uk: хв

# MoveDownDefaultText
source: Move down
ja: 引き下げる
uk: Опустити вниз

# MoveUpDefaultText
source: Move up
ja: 持ち上げる
uk: Підняти вгору

# NoPlaylistDefaultText
source: Looks like you don't have any playlists created...
ja: プレイリストが作成されていないようだが......。
uk: Схоже, у вас немає створених плейлистів...

# QuestionPlaylist
source: Are you sure you want to delete this playlist?
ja: 本当にこのプレイリストを削除しますか？
uk: Ви впевнені що хочете видалити цей плейлист?

# QuestionTrack
source: Are you sure you want to delete this track?
ja: 本当にこのトラックを削除しますか？
uk: Ви впевнені що хочете видалити цей трек?

# RemoveButtonText
source: Delete
ja: 削除
uk: Видалити

# RemovePlaylistText
source: Remove playlist
ja: プレイリストの削除
uk: Прибрати плейлист

# RenameDefaultText
source: Rename
ja: 名前変更
uk: Перейменувати

# RenamePlaylistText
source: Rename playlist
ja: プレイリストの名前を変更する
uk: Перейменувати плейлист

# SearchBarTextBoxDefaultText
source: What do you want to listen to?
ja: 何を聴きたい？
uk: Що хочете послухати?

# SearchEngineLabelText
source: Search Engine:
ja: 検索エンジン：
uk: Пошукова система:

# SearchEngineToolTipText
source: If you can't find a track that is on YouTube you can safely change your search engine and enjoy music from YouTube.
ja: YouTubeにアップされている曲が見つからない場合は、検索エンジンを変えてYouTubeから簡単に音楽を楽しむことができる。
uk: Якщо ви не можете знайти трек, який є в YouTube, ви можете спокійно поміняти пошукову систему і насолоджуватися музикою з YouTube.

# SecondsText
source: sec
ja: 秒
uk: сек

# SelectImageDefaultText
source: Select an image...
ja: 画像を選択...
uk: Виберіть зображення...

# SettingsMenuItemHeader
source: Settings
ja: 設定だ。
uk: Налаштування

# SongAuthorDefaultText
source: Unknown Author
ja: アーティスト不明
uk: Невідомий Артист

# SongTitleDefaultText
source: Unknown Track
ja: 不明なトラック
uk: Невідомий трек

# TipStartWrittingText
source: Start writing something to enjoy the music!
ja: 曲を楽しむために何かを書き始める！
uk: Почніть писати щось, щоб насолоджуватися піснями!

# TitlePlaylistDefaultText
source: Title:
ja: タイトル
uk: Назва:

# TrackDefaultText
source: Track:
ja: トラック：
uk: Трек:

# TrafficDefaultText
source: Traffic Savings:
ja: トラフィックを節約する：
uk: Економія трафіку:

# TrafficToolTipDefaultText
source: Removes pictures from songs that load during song search.
ja: 楽曲検索時に読み込んだ楽曲から画像を削除します。
uk: Прибирає картинки з пісень які завантажуются під час пошуку пісень.

# YourPlaylistText
source: Your playlists
ja: プレイリスト
uk: Ваші плейлисти
